In [1]:
import seaborn as sns

In [11]:
df = sns.load_dataset(name="dowjones")

In [21]:
df['year'] = df['Date'].dt.year

In [25]:
df = df.drop('Date', axis=1)

In [40]:
summary_df = df.groupby(['year']).mean().reset_index()

In [58]:
summary_df['Max Price'] = df.groupby(['year']).max().reset_index()['Price']
summary_df['Min Price'] = df.groupby(['year']).min().reset_index()['Price']

In [59]:
summary_df.head(5)

   year      Price  Max Price  Min Price
0  1914  55.000000      55.00      55.00
1  1915  74.329167      97.00      56.00
2  1916  94.791667     107.90      88.45
3  1917  87.729167      97.15      70.20
4  1918  81.066667      86.25      76.60

In [61]:
pv_tb = summary_df.pivot_table(columns='year')

In [78]:
pv_tb.reset_index().melt( id_vars='index', var_name='year', value_name = 'value')

         index  year       value
0    Max Price  1914   55.000000
1    Min Price  1914   55.000000
2        Price  1914   55.000000
3    Max Price  1915   97.000000
4    Min Price  1915   56.000000
..         ...   ...         ...
160  Min Price  1967  830.560000
161      Price  1967  879.120000
162  Max Price  1968  965.390000
163  Min Price  1968  834.760000
164      Price  1968  905.746667

[165 rows x 3 columns]